jantielens/esp32-macropad/src/app/drivers/mipi_dsi_driver.cpp
    srm.rotation_angle = angle;
    srm.scale_x = 1.0f;
    srm.scale_y = 1.0f;

    // Save physical coords for PPA done callback → draw_bitmap().
    // Safe: LVGL won't call pushColors again until flush_ready() fires.
    physX = px;
    physY = py;
    physW = pw;
    physH = ph;

    // Non-blocking: PPA rotates in hardware, then onPpaDone() chains
    // into draw_bitmap() for DMA2D copy.  Meanwhile LVGL can render
    // the next tile into the alternate draw buffer (double buffering).
    srm.mode = PPA_TRANS_MODE_NON_BLOCKING;
    srm.user_data = this;

    esp_err_t err = ppa_do_scale_rotate_mirror(ppaClient, &srm);
    if (err != ESP_OK) {
        LOGE(getLogTag(), "PPA rotate failed: 0x%x", err);
        // Signal flush_ready so LVGL doesn't stall
        lv_display_flush_ready(lvglDisplay);
        return;
    }
}

void MipiDsiDriver::configureLVGL(lv_display_t* disp, uint8_t rotation) {
    lvglDisplay = disp;
    // Register DMA2D completion callback so LVGL knows the draw buffer
    // can be recycled once the hardware copy finishes.
    esp_lcd_dpi_panel_event_callbacks_t cbs = {};
    cbs.on_color_trans_done = onColorTransDone;
    ESP_ERROR_CHECK(esp_lcd_dpi_panel_register_event_callbacks(panel_handle, &cbs, disp));
    LOGI(getLogTag(), "DMA2D flush callback registered");
}

bool MipiDsiDriver::asyncFlush() const {
    return true;
}

// Zero the DPI framebuffer and flush PSRAM cache so the scanout sees black.
// The ESP-IDF DPI peripheral keeps streaming the framebuffer over the MIPI
// lanes at 60 Hz even after DCS Sleep In, so the only reliable way to
// protect IPS cells from hours of identical content (image-persistence /
// ghosting) is to make sure that ongoing scanout reads all-zeros.
// (Note: esp_lcd_panel_disp_on_off() on the DPI panel handle is not
// implemented in our ESP-IDF version — it returns ESP_ERR_NOT_SUPPORTED
// and logs an error — so framebuffer blanking is the actual mitigation.)
// Fill the DPI framebuffer with a byte-uniform RGB565 color (0x0000 black,
// 0xFFFF white) and flush the PSRAM cache so the DPI peripheral's continuous
// scanout reads the new content. The high and low bytes of `color` must match
// for memset to produce the intended pixel value.
void MipiDsiDriver::fillFramebuffers(uint16_t color) {
    if (!panel_handle) return;
    void* fb0 = nullptr;
    if (esp_lcd_dpi_panel_get_frame_buffer(panel_handle, 1, &fb0) != ESP_OK) {
        return;
    }
    if (!fb0) return;
    const int fill = (int)(color & 0xFF);
    const size_t fb_bytes = (size_t)displayWidth * (size_t)displayHeight * sizeof(uint16_t);
    memset(fb0, fill, fb_bytes);
    esp_cache_msync(fb0, fb_bytes, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
}

void MipiDsiDriver::blankFramebuffers() {
    fillFramebuffers(0x0000);
}

void MipiDsiDriver::sendInitCommands() {
    if (!ioHandle) return;
    const mipi_dsi_init_cmd_t* cmds = getInitCommands();
    const size_t num_cmds = getInitCommandCount();
    for (size_t i = 0; i < num_cmds; i++) {
        ESP_ERROR_CHECK(esp_lcd_panel_io_tx_param(
            ioHandle, cmds[i].cmd, cmds[i].data, cmds[i].data_bytes
        ));
        if (cmds[i].delay_ms > 0) {
            delay(cmds[i].delay_ms);
        }
    }
    LOGI(getLogTag(), "Sent %d vendor init commands", (int)num_cmds);
}

#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
// Deassert RST, wait for the panel IC to come out of reset, then re-run
// the full vendor init sequence. The JD9165 (and most TDDI controllers)
// require only ~10-20 ms post-RST settle before accepting DBI commands;
// 50 ms is a conservative margin that still saves ~70 ms of wake latency
// versus the cold-boot 120 ms. The vendor init table ends with Sleep Out
// (0x11, +120 ms) and Display On (0x29, +50 ms), so no additional DCS
// commands are needed after this returns.
void MipiDsiDriver::wakeFromHardReset() {
    digitalWrite(LCD_RST_PIN, HIGH);
    delay(50);
    sendInitCommands();
}
#else
void MipiDsiDriver::wakeFromHardReset() {}
#endif

void MipiDsiDriver::displaySleep() {
    if (!ioHandle) return;

    // Blank framebuffers so the DPI peripheral's continuous scanout reads
    // black for the entire sleep period (image-retention mitigation).
    // We intentionally do NOT call esp_lcd_panel_disp_on_off(panel, false)
    // here — the DPI panel driver in our ESP-IDF version doesn't implement
    // it and would just log "disp_on_off is not supported by this panel".
    blankFramebuffers();

#if DISPLAY_KEEP_PANEL_AWAKE_ON_SLEEP
    // Keep the panel fully powered in normal Display On, scanning the now-black
    // framebuffer with frame inversion active (backlight already faded to 0).
    // The opaque top-layer sleep overlay keeps LVGL rendering black, so the
    // panel scans a DC-balanced all-black frame throughout sleep. No DCS
    // power-down and no RST toggle: this avoids both the DC bias of Sleep In
    // (washed-out colors) and the hard-reset power-cycling (morning flicker).
    return;
#else
    // Standard DCS power-down: Display Off → Sleep In.
    esp_lcd_panel_io_tx_param(ioHandle, 0x28, NULL, 0);  // Display Off
    delay(20);
    esp_lcd_panel_io_tx_param(ioHandle, 0x10, NULL, 0);  // Sleep In

    // Optional deep sleep: hold panel RST LOW so the panel IC fully powers
    // down its internal regulators. Required on cheap IPS MIPI-DSI panels
    // (e.g. JD9165) where DCS Sleep In alone leaves the TFT cells DC-biased
    // and slowly drifts VCOM, producing washed-out colors after multi-hour
    // idle. Wake re-runs the vendor init sequence.
#if DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    digitalWrite(LCD_RST_PIN, LOW);
#endif
#endif
}

void MipiDsiDriver::displayWake() {
    if (!ioHandle) return;
#if DISPLAY_KEEP_PANEL_AWAKE_ON_SLEEP
    // Panel never slept; the backlight fade restores visibility. Nothing to do.
    return;
#elif DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    wakeFromHardReset();
#else
    esp_lcd_panel_io_tx_param(ioHandle, 0x11, NULL, 0);  // Sleep Out
    delay(120);                                           // MIPI DCS spec minimum
    esp_lcd_panel_io_tx_param(ioHandle, 0x29, NULL, 0);  // Display On
#endif
}

