jantielens/esp32-macropad/src/app/drivers/mipi_dsi_driver.cpp
void MipiDsiDriver::displayWakeSleepOut() {
    if (!ioHandle) return;
#if DISPLAY_KEEP_PANEL_AWAKE_ON_SLEEP
    // Panel never slept (single-phase wake); nothing to do.
    return;
#elif DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    // Hard-reset wake is single-phase (see needsTwoPhaseWake()): replay the
    // full init sequence here. The screensaver skips the 120 ms gap and the
    // second displayWakeDisplayOn() call so the display lock is only held
    // once, for the duration of wakeFromHardReset().
    wakeFromHardReset();
#else
    esp_lcd_panel_io_tx_param(ioHandle, 0x11, NULL, 0);  // Sleep Out
#endif
}

void MipiDsiDriver::displayWakeDisplayOn() {
    if (!ioHandle) return;
#if DISPLAY_KEEP_PANEL_AWAKE_ON_SLEEP
    // Unreachable: needsTwoPhaseWake() returns false so the screensaver never
    // calls this. The panel never slept anyway. Guarded out for safety.
    return;
#elif DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    // Unreachable: needsTwoPhaseWake() returns false in hard-reset mode so
    // screen_saver_manager never calls this. Guarded out for safety.
    return;
#else
    esp_lcd_panel_io_tx_param(ioHandle, 0x29, NULL, 0);  // Display On
#endif
}

bool MipiDsiDriver::needsTwoPhaseWake() const {
#if DISPLAY_KEEP_PANEL_AWAKE_ON_SLEEP
    return false;
#elif DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    return false;
#else
    return true;
#endif
}

// Periodic scrub during long idle, called by the screensaver every
// SCREENSAVER_SLEEP_REFRESH_MS while fully asleep.
//   - Keep-awake mode: the panel stays powered and scanning, so this just
//     re-blanks the framebuffer as insurance against any transient LVGL
//     write that slipped past the opaque overlay.
//   - Hard-reset mode: actively de-bias the LC by briefly powering the panel
//     up and driving full-frame white↔black inversion cycles (backlight off),
//     then powering it down again. Power-down alone does not de-bias these
//     cheap IPS cells — the trapped DC just relaxes slowly (the washed-out
//     colors that fade a few minutes after wake), so the periodic inversion is
//     what actually prevents the buildup. A soft-landing settle then lets the
//     panel reach VCOM equilibrium before RST is re-asserted LOW; freezing the
//     panel mid-equilibration leaves it in a marginal VCOM state that flickers
//     for minutes on the next wake. Leaves RST LOW + framebuffers black so the
//     normal hard-reset wake path is unchanged.
//   - Otherwise: re-blank the framebuffer as insurance against any transient
//     LVGL write that slipped past the opaque top-layer overlay (e.g. overlay
//     teardown race during fade-in) leaving stale pixels to ghost over hours.
void MipiDsiDriver::displayRefreshSleep() {
#if DISPLAY_KEEP_PANEL_AWAKE_ON_SLEEP
    // Panel stays in Display On scanning black; just re-blank as insurance.
    blankFramebuffers();
#elif DISPLAY_HARD_RESET_ON_SLEEP && defined(LCD_RST_PIN)
    if (!ioHandle) return;
    // Power the panel back up (replays vendor init; backlight stays at 0).
    wakeFromHardReset();
    // Drive opposite-polarity full-frame cycles to cancel accumulated DC bias.
    for (int i = 0; i < DISPLAY_DEBIAS_CYCLES; i++) {
        fillFramebuffers(0xFFFF);  // white
        delay(DISPLAY_DEBIAS_HOLD_MS);
        fillFramebuffers(0x0000);  // black
        delay(DISPLAY_DEBIAS_HOLD_MS);
    }
    // Soft landing: hold a uniform black frame with the panel still scanning so
    // its per-frame inversion averages the residual LC/VCOM bias toward zero,
    // instead of freezing the panel on the last-driven polarity. fillFramebuffers
    // already left black above; the settle is the dwell that matters.
    fillFramebuffers(0x0000);  // black (explicit; cheap and self-documenting)
#if DISPLAY_DEBIAS_SETTLE_MS > 0
    delay(DISPLAY_DEBIAS_SETTLE_MS);
#else
    delay(5);
#endif
    // Graceful DCS power-down: Display Off → (VCOM discharge window) → Sleep In,
    // then hold RST LOW. The dwell on Display Off gives the panel's internal
    // VCOM/source discharge time to equalize so it powers down from a balanced
    // state, mirroring displaySleep() but with the extra settle the abrupt
    // periodic path lacked. RST low alone would reset the controller regardless,
    // but mirroring the standard power-down keeps the resting state identical to
    // a normal sleep entry.
    esp_lcd_panel_io_tx_param(ioHandle, 0x28, NULL, 0);  // Display Off
#if DISPLAY_DEBIAS_SETTLE_MS > 0
    delay(DISPLAY_DEBIAS_SETTLE_MS);
#else
    delay(20);
#endif
    esp_lcd_panel_io_tx_param(ioHandle, 0x10, NULL, 0);  // Sleep In
    digitalWrite(LCD_RST_PIN, LOW);
#else
    blankFramebuffers();
#endif
}
